# LevelDataMassTypeComments Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LevelDataMassTypeComments Property
ParameterTypeId Class See Also
---
"Mass: Type Comments"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LevelDataMassTypeComments { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelDataMassTypeComments As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LevelDataMassTypeComments {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace